import pandas as pd

s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
print(s1+s2)


table_data3 = {'봄': [265.5, 264.3, 215.9, 223.2, 312.8],
                '여름':[770.6,567.5,599.8, 387.1, 446.2],
                '가을':[353.5, 231.2,293.1, 247.7, 381.6],
                '겨울':[193.3, 59.9, 76.9, 169.1, 100.1]}
columns_list =['봄','여름','가을','겨울']
index_list = ['2012','2013','2014','2015','2016']

df3 = pd.DataFrame(table_data3,columns = columns_list,index=index_list)
print(df3)
'''
          봄     여름     가을     겨울
2021  265.5  770.6  353.5  193.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  169.1
2016  312.8  446.2  381.6  100.1
'''

print(df3.mean())
'''
봄     256.34
여름    554.24
가을    301.42
겨울    119.86
dtype: float64
'''

print(df3.mean(axis=1))
'''
2012    395.725
2013    280.725
2014    296.425
2015    256.775
2016    310.175
dtype: float64
'''

print(df3.describe())